import Container from "react-bootstrap/Container";
import Row from "react-bootstrap/Row";

import "../../index.css";
import { Col, Image } from "react-bootstrap";

const SinglePage = () => {
  const Fristtitle1 = [
    {
      id: 1,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      Nowtime:
        "প্রতিবেদক, ঢাকা ১৯ মার্চ, ২০২৪ ১৫:০২ | আপডেট: ১৯ মার্চ, ২০২৪ ১৫:১৫",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য হওয়া ক্রিকেটার সাকিব আল হাসানের অন্য কোনো দলে যোগ দেয়া নিয়ে তাদের  কাছে তথ্য নেই বলে জানিয়েছেন আওয়ামী লীগের সাধারণ সম্পাদক এবং সড়ক পরিবহন ও সেতুমন্ত্রী ওবায়দুল কাদের।  তিনি বলেছেন, ‘দলের মনোনয়ন নেয়ার আগে প্রাথমিক সদস্য হয়েছিলেন ক্রিকেটার সাকিব আল হাসান। অন্য দলে যাওয়ার বিষয়ে কিছু জানি না।’  রাজধানীতে বঙ্গবন্ধু এভিনিউয়ে আওয়ামী লীগের কেন্দ্রীয় কার্যালয়ে এক সংবাদ সম্মেলনে মঙ্গলবার ওবায়দুল কাদের কথা বলেন।  নির্বাচনের আগে ক্রিকেটার সাকিবের বিএনএমে যোগদানের বিষয়ে সম্প্রতি একটি পত্রিকায় সংবাদ প্রকাশ হয়।  ওই প্রসঙ্গে আওয়ামী লীগের সাধারণ সম্পাদক বলেন, ‘আমি বিষয়টি মিডিয়ায় দেখেছি। এ সম্পর্কে আমার কিছু জানা ছিল না। আওয়ামী লীগের টিকিটে মাগুরা থেকে নির্বাচন করেছে, জয়লাভও করেছে।  এর জন্য পার্টির কাছে যাওয়ার সময় সে দলের প্রাথমিক সদস্য হয়েছে। তার আগে তো সাকিব আমাদের দলের কেউ ছিল না।  নমিনেশন দেয়ার সময় প্রাথমিক সদস্য পদ দিতে হয়। এর আগের বিষয়টা জানি না।’  গত জাতীয় নির্বাচনে কিংস পার্টির সৃষ্টি নিয়ে সরকারের ভূমিকা আছে কিনা এমন প্রশ্নের জবাবে সড়ক পরিবহন ও    সেতু মন্ত্রী বলেন, ‘সরকারি দল কিংস পার্টি করতে যাবে কেন? নির্বাচনকে সামনে রেখে রাজনৈতিক দলের এখানে অনেক ফুল ফোটে। কোনটা কিংস পার্টি, কোনটা প্রজা পার্টি এ সম্পর্কে আমাদের কিছু জানা নেই। আমরা প্রত্যেককে রাজনৈতিক দল হিসেবে দেখি। নির্বাচন কমিশন তাদের নিবন্ধন দেয়।’ আওয়ামী লীগের বিরুদ্ধে বিএনপিকে ভাঙার অভিযোগ নিয়ে এক বিএনপি নেতার বক্তব্যের বিষয়ে ওবায়দুল কাদের বলেন, ‘বিএনপিকে আমরা কেন ভাঙতে যাব? আমাদের কি কোনো দুর্বলতা আছে, যে বিএনপি থেকে লোক এনে সে ঘাটতি পূরণ করতে হবে। আওয়ামী লীগের বহু লোক। গত নির্বাচনে দেখেছেন প্রার্থিতা ফরম নিতে কত ভিড়। আওয়ামী লীগে কোনো দুর্ভিক্ষ নেই।’ তিনি বলেন, ‘বিএনপির নেতারা ক্লান্ত, কর্মীরা হতাশ। এ অবস্থায় গালিগালাজ করা ছাড়া তাদের করার কিছু নেই। দলটি এখন ইফতার পার্টির নামে সরকারের অন্ধ সমালোচনা করছে। এটাকে ইফতার পার্টি বলব নাকি গিবত পার্টি বলব?’ বাংলাদেশের গণতন্ত্র উদ্ধারে প্রতিবেশী বন্ধু রাষ্ট্রের সহযোগিতা চাওয়া নিয়ে বিএনপির এক নেতার বক্তব্যর বিষয়ে আওয়ামী লীগ সাধারণ সম্পাদক বলেন, ‘তারা বন্ধু রাষ্ট্র বলতে ভারতকে বুঝিয়েছে। গণতন্ত্র তো আমাদের ঠিকই আছে। নির্বাচনও হয়েছে। বিএনপির বন্ধুপ্রতিম দেশের কাছে সাহায্য চাওয়ার অর্থ তাদের ক্ষমতায় বসিয়ে দেয়া। জনগণের সমর্থন ছাড়া সরকার পরিবর্তন সম্ভব নয়",
    },
  ];

  const Redmore = [
    {
      id: 1,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 1,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 1,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 2,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 3,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 4,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 5,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 6,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 7,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
    {
      id: 8,
      title:
        "সাকিব আওয়ামী লীগের সদস্য, অন্য দলে যাওয়ার বিষয়ে জানি না: কাদের",
      image: require("../../Images/Logo/Logo1.png"),
      desc: "আওয়ামী লীগের টিকিট পেয়ে দ্বাদশ সংসদ নির্বাচনের মাধ্যমে সংসদ সদস্য ",
    },
  ];

  return (
    <Container style={{ marginTop: "1.5%" }}>
      <Row>
        <Col xs={12} md={8}>
          {Fristtitle1.slice(0, 3).map((item) => (
            <Col xs={12} md={12} key={item.id}>
              <h3
                style={{
                  textAlign: "left",
                }}
                className="SolaimanLipi"
              >
                {item.title}
              </h3>
              <p className="SolaimanLipi" style={{ textAlign: "left" }}>
                {item?.Nowtime}
              </p>
              <Image src={item.image} alt="logo" fluid style={{}} />
              <h4
                style={{
                  textAlign: "left",
                  marginTop: "2%",
                }}
                className="SolaimanLipi"
              >
                {item.desc}
              </h4>
            </Col>
          ))}
        </Col>

        <Col xs={12} md={4}>
          <p style={{ textAlign: "left" }}>আরও পড়ুন</p>
          {Redmore.slice(0, 6).map((item) => (
            <Row>
              <Col xs={12} md={8} key={item.id}>
                <h3
                  style={{
                    textAlign: "left",
                  }}
                  className="SolaimanLipi"
                >
                  {item.title}
                </h3>

                <h4
                  style={{
                    textAlign: "left",
                    marginTop: "2%",
                  }}
                  className="SolaimanLipi"
                >
                  {item.desc}
                </h4>
              </Col>
              <Col xs={12} md={4} key={item.id}>
                <Image src={item.image} alt="logo" fluid style={{}} />
              </Col>
            </Row>
          ))}
        </Col>
      </Row>
    </Container>
  );
};

export default SinglePage;
